zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213axx_ca35.h
   LTDC_ER_IRQn                     = 174,     /*!< LTDC global error interrupt                                         */
   LTDC_SEC_IRQn                    = 175,     /*!< LTDC security global interrupt                                      */
   LTDC_SEC_ER_IRQn                 = 176,     /*!< LTDC security global error interrupt                                */
   SAI2_IRQn                        = 177,     /*!< SAI2 global interrupt                                               */
   OCTOSPI1_IRQn                    = 178,     /*!< OCTOSPI1 global interrupt                                           */
   RESERVED_179                     = 179,      /*!< reserved                                                            */
   RESERVED_180                     = 180,     /*!< reserved                                                            */
   LPTIM1_IRQn                      = 181,     /*!< LPTIMER1 global interrupt                                           */
   USBH_WAKEUP_IRQn                 = 182,     /*!< USBH Remote  Wake up from USB2PHY1                                  */
   SPDIFRX_IRQn                     = 183,     /*!< SPDIFRX global interrupt                                            */
   IPCC1_RX_IRQn                    = 184,     /*!< Mailbox 1 RX Occupied  interrupt                                    */
   IPCC1_TX_IRQn                    = 185,     /*!< Mailbox 1 TX Free  interrupt                                        */
   IPCC1_RX_S_IRQn                  = 186,     /*!< Mailbox 1 RX Occupied secure interrupt                              */
   IPCC1_TX_S_IRQn                  = 187,     /*!< Mailbox 1 TX Free secure interrupt                                  */
   RESERVED_188                     = 188,     /*!< reserved                                                            */
   RESERVED_189                     = 189,     /*!< reserved                                                            */
   OTG_WAKEUP_IRQn                  = 190,     /*!< USB2 DR Remote  Wake up from USB2PHY2                               */
   RESERVED_191                     = 191,     /*!< reserved                                                            */
   MDF1_FLT0_IRQn                   = 192,     /*!< MDF1 Filter0 Interrupt                                              */
   MDF1_FLT1_IRQn                   = 193,     /*!< MDF1 Filter1 Interrupt                                              */
   MDF1_FLT2_IRQn                   = 194,     /*!< MDF1 Filter2 Interrupt                                              */
   MDF1_FLT3_IRQn                   = 195,     /*!< MDF1 Filter3 Interrupt                                              */
   SAI3_IRQn                        = 196,     /*!< SAI3 global interrupt                                               */
   TIM15_IRQn                       = 197,     /*!< TIM15 global interrupt                                              */
   TIM16_IRQn                       = 198,     /*!< TIM16 global interrupt                                              */
   TIM17_IRQn                       = 199,     /*!< TIM17 global interrupt                                              */
   TIM12_IRQn                       = 200,     /*!< TIM12 global interrupt                                              */
   SDMMC2_IRQn                      = 201,     /*!< SDMMC2 global interrupt                                             */
   DCMIPP_IRQn                      = 202,     /*!< DCMIPP global interrupt                                             */
   RESERVED_203                     = 203,     /*!< reserved                                                                */
   CPU2_SYSRESETQ_IRQn              = 204,     /*!< MCU local Reset Request through EXTI                                */
   TIM13_IRQn                       = 205,     /*!< TIM13 global interrupt                                              */
   TIM14_IRQn                       = 206,     /*!< TIM14 global interrupt                                              */
   TIM10_IRQn                       = 207,     /*!< TIM10 global interrupt                                              */
   RNG1_IRQn                        = 208,     /*!< RNG1 interrupt                                                      */
   ADF1_FLT_IRQn                    = 209,     /*!< ADF1 Filter Interrupt                                               */
   HASH2_IRQn                       = 210,     /*!< Hash2  interrupt                                                    */
   SDMMC3_IRQn                      = 211,     /*!< SDMMC3 Global interrupt                                             */
   LPTIM2_IRQn                      = 212,     /*!< LPTIMER2 global interrupt                                           */
   LPTIM3_IRQn                      = 213,     /*!< LPTIMER3 global interrupt                                           */
   LPTIM4_IRQn                      = 214,     /*!< LPTIMER4 global interrupt                                           */
   LPTIM5_IRQn                      = 215,     /*!< LPTIMER5 global interrupt                                           */
   RESERVED_216                     = 216,     /*!< reserved                                                            */
   CPU2_SEV_IRQn                    = 217,     /*!< Cortex-M33 Send Event through EXTI                                  */
   RCC_WAKEUP_IRQn                  = 218,     /*!< RCC CPU1 Wake up interrupt                                          */
   SAI4_IRQn                        = 219,     /*!< SAI4 global interrupt                                               */
   DTS_IRQn                         = 220,     /*!< Temperature sensor interrupt                                        */
   TIM11_IRQn                       = 221,     /*!< TIM11 global interrupt                                              */
   CPU1_WAKEUP_PIN_IRQn             = 222,     /*!< Interrupt for all 6 wake-up enabled by CPU1                         */
   OTG_IRQn                         = 223,     /*!< USB2 DR global interrupt                                            */
   RNG2_IRQn                        = 224,     /*!< RNG2 interrupt                                                      */
   RESERVED_225                     = 225,     /*!< reserved                                                            */
   RESERVED_226                     = 226,     /*!< reserved                                                            */
   SERF_IRQn                        = 227,     /*!< SERF global interrupt                                               */
   BUSPERFM_IRQn                    = 228,     /*!< BUS Performance Monitor Interrupt                                   */
   RAMCFG_IRQn                      = 229,     /*!< RAM configuration global interrupt                                  */
   DDRCTRL_IRQn                     = 230,     /*!< DDRCTRL interrupt                                                   */
   DDRPHYC_IRQn                     = 231,     /*!< DDRPHY interrupt (active low)                                       */
   DFI_ERR_IRQn                     = 232,     /*!< DDRPHY DFI error Interrupt                                          */
   IAC_IRQn                         = 233,     /*!< RIF Illegal access Controller interrupt                             */
   VDDCPU_VD_IRQn                   = 234,     /*!< VDDCPU voltage detector                                             */
   VDDCORE_VD_IRQn                  = 235,     /*!< VDDCORE voltage detector                                            */
   RETRAMCRC_ERR_IT_IRQn            = 236,     /*!< RETRAM CRC error                                                    */
   HPDMA1_WKUP_IRQn                 = 237,     /*!< HPDMA1 channel 0 to 15 wake up                                      */
   HPDMA2_WKUP_IRQn                 = 238,     /*!< HPDMA2 channel 0 to 15 wake up                                      */
   HPDMA3_WKUP_IRQn                 = 239,     /*!< HPDMA3 channel 0 to 15 wake up                                      */
   DBG_AUTH_HOST_IRQn               = 240,     /*!< Debugger has written DBG_AUTH_HOST register                         */
   DBG_AUTH_ACK_IRQn                = 241,     /*!< Debugger has read DBG_AUTH_ACKregister                              */
   RCC_HSI_FMON_IRQn                = 242,     /*!< HSI Frequency Monitor                                               */
   VDDGPU_VD_IRQn                   = 243,     /*!< VDDGPU voltage detector                                             */
   RESERVED_244                     = 244,     /*!< reserved                                                            */
   RESERVED_245                     = 245,     /*!< reserved                                                            */
   RESERVED_246                     = 246,     /*!< reserved                                                            */
   RESERVED_247                     = 247,     /*!< reserved                                                            */
   RESERVED_248                     = 248,     /*!< reserved                                                            */
   RESERVED_249                     = 249,     /*!< reserved                                                            */
   RESERVED_250                     = 250,     /*!< reserved                                                            */
   RESERVED_251                     = 251,     /*!< reserved                                                            */
   RESERVED_252                     = 252,     /*!< reserved                                                            */
   RESERVED_253                     = 253,     /*!< reserved                                                            */
   RESERVED_254                     = 254,     /*!< reserved                                                            */
   RESERVED_255                     = 255,     /*!< reserved                                                            */
   RESERVED_256                     = 256,     /*!< reserved                                                            */
   RESERVED_257                     = 257,     /*!< reserved                                                            */
   RESERVED_258                     = 258,     /*!< reserved                                                            */
   RESERVED_259                     = 259,     /*!< reserved                                                            */
   RESERVED_260                     = 260,     /*!< reserved                                                            */
   RESERVED_261                     = 261,     /*!< reserved                                                            */
   RESERVED_262                     = 262,     /*!< reserved                                                            */
   RESERVED_263                     = 263,     /*!< reserved                                                            */
   RESERVED_264                     = 264,     /*!< reserved                                                            */
   RESERVED_265                     = 265,     /*!< reserved                                                            */
   RESERVED_266                     = 266,     /*!< reserved                                                            */
   RESERVED_267                     = 267,     /*!< reserved                                                            */
   RESERVED_268                     = 268,     /*!< reserved                                                            */
   RESERVED_269                     = 269,     /*!< reserved                                                            */
   RESERVED_270                     = 270,     /*!< reserved                                                            */
   RESERVED_271                     = 271,     /*!< reserved                                                            */
   RESERVED_272                     = 272,     /*!< reserved                                                            */
   RESERVED_273                     = 273,     /*!< reserved                                                            */
   RESERVED_274                     = 274,     /*!< reserved                                                            */
   RESERVED_275                     = 275,     /*!< reserved                                                            */
   RESERVED_276                     = 276,     /*!< reserved                                                            */
   RESERVED_277                     = 277,     /*!< reserved                                                            */
   RESERVED_278                     = 278,     /*!< reserved                                                            */
   RESERVED_279                     = 279,     /*!< reserved                                                            */
   RESERVED_280                     = 280,     /*!< reserved                                                            */
   RESERVED_281                     = 281,     /*!< reserved                                                            */
   RESERVED_282                     = 282,     /*!< reserved                                                            */
   RESERVED_283                     = 283,     /*!< reserved                                                            */
   RESERVED_284                     = 284,     /*!< reserved                                                            */
   RESERVED_285                     = 285,     /*!< reserved                                                            */
   RESERVED_286                     = 286,     /*!< reserved                                                            */
   RESERVED_287                     = 287,     /*!< reserved                                                            */
   RESERVED_288                     = 288,     /*!< reserved                                                            */
   RESERVED_289                     = 289,     /*!< reserved                                                            */
   RESERVED_290                     = 290,     /*!< reserved                                                            */
   RESERVED_291                     = 291,     /*!< reserved                                                            */
   RESERVED_292                     = 292,     /*!< reserved                                                            */
   RESERVED_293                     = 293,     /*!< reserved                                                            */
   RESERVED_294                     = 294,     /*!< reserved                                                            */
   RESERVED_295                     = 295,     /*!< reserved                                                            */
   RESERVED_296                     = 296,     /*!< reserved                                                            */
   RESERVED_297                     = 297,     /*!< reserved                                                            */
   RESERVED_298                     = 298,     /*!< reserved                                                            */
   RESERVED_299                     = 299,     /*!< reserved                                                            */
   EXTI1_0_IRQn                     = 300,     /*!< EXTI1 Line 0 interrupt                                              */
   EXTI1_1_IRQn                     = 301,     /*!< EXTI1 Line 1 interrupt                                              */
   EXTI1_2_IRQn                     = 302,     /*!< EXTI1 Line 2 interrupt                                              */
   EXTI1_3_IRQn                     = 303,     /*!< EXTI1 Line 3 interrupt                                              */
   EXTI1_4_IRQn                     = 304,     /*!< EXTI1 Line 4 interrupt                                              */
   EXTI1_5_IRQn                     = 305,     /*!< EXTI1 Line 5 interrupt                                              */
   EXTI1_6_IRQn                     = 306,     /*!< EXTI1 Line 6 interrupt                                              */
   EXTI1_7_IRQn                     = 307,     /*!< EXTI1 Line 7 interrupt                                              */
   EXTI1_8_IRQn                     = 308,     /*!< EXTI1 Line 8 interrupt                                              */
   EXTI1_9_IRQn                     = 309,     /*!< EXTI1 Line 9 interrupt                                              */
   EXTI1_10_IRQn                    = 310,     /*!< EXTI1 Line 10 interrupt                                             */
   EXTI1_11_IRQn                    = 311,     /*!< EXTI1 Line 11 interrupt                                             */
   EXTI1_12_IRQn                    = 312,     /*!< EXTI1 Line 12 interrupt                                             */
   EXTI1_13_IRQn                    = 313,     /*!< EXTI1 Line 13 interrupt                                             */
   EXTI1_14_IRQn                    = 314,     /*!< EXTI1 Line 14 interrupt                                             */
   EXTI1_15_IRQn                    = 315,     /*!< EXTI1 Line 15 interrupt                                             */
   RESERVED_316                     = 316,     /*!< reserved                                                            */
   RESERVED_317                     = 317,     /*!< reserved                                                            */
   RESERVED_318                     = 318,     /*!< reserved                                                            */
   RESERVED_319                     = 319,     /*!< reserved                                                            */
   RESERVED_320                     = 320,     /*!< reserved                                                            */
   RESERVED_321                     = 321,     /*!< reserved                                                            */
   RESERVED_322                     = 322,     /*!< reserved                                                            */
   RESERVED_323                     = 323,     /*!< reserved                                                            */
   RESERVED_324                     = 324,     /*!< reserved                                                            */
   RESERVED_325                     = 325,     /*!< reserved                                                            */
   RESERVED_326                     = 326,     /*!< reserved                                                            */
   RESERVED_327                     = 327,     /*!< reserved                                                            */
   RESERVED_328                     = 328,     /*!< reserved                                                            */
   RESERVED_329                     = 329,     /*!< reserved                                                            */
   RESERVED_330                     = 330,     /*!< reserved                                                            */
   RESERVED_331                     = 331,     /*!< reserved                                                            */
   RESERVED_332                     = 332,     /*!< reserved                                                            */
   RESERVED_333                     = 333,     /*!< reserved                                                            */
   RESERVED_334                     = 334,     /*!< reserved                                                            */
   RESERVED_335                     = 335,     /*!< reserved                                                            */
   RESERVED_336                     = 336,     /*!< reserved                                                            */
   RESERVED_337                     = 337,     /*!< reserved                                                            */
   RESERVED_338                     = 338,     /*!< reserved                                                            */
   RESERVED_339                     = 339,     /*!< reserved                                                            */
   IS2M_IRQn                        = 340,     /*!< IS2M  fault detect                                                  */
   L2WERRIRQ_IRQn                   = 341,     /*!< Error indicator frm L2  for memory transactions with a write response error condition.*/
   DDRPERFM_IRQn                    = 342,     /*!< DDR Performance Monitor Interrupt                                   */
   RESERVED_343                     = 343,     /*!< reserved                                                            */
   PMSTAT0_IRQn                     = 344,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT1_IRQn                     = 345,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT2_IRQn                     = 346,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT3_IRQn                     = 347,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT4_IRQn                     = 348,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT5_IRQn                     = 349,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT6_IRQn                     = 350,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT7_IRQn                     = 351,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT8_IRQn                     = 352,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT9_IRQn                     = 353,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT10_IRQn                    = 354,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT11_IRQn                    = 355,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT12_IRQn                    = 356,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT13_IRQn                    = 357,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT14_IRQn                    = 358,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT15_IRQn                    = 359,     /*!< Power management, PLL and sensor interrupts                         */
   PMSTAT16_IRQn                    = 360,     /*!< Power management, PLL and sensor interrupts                         */
   RESERVED_361                     = 361,     /*!< reserved                                                            */
   RESERVED_362                     = 362,     /*!< reserved                                                            */
   RESERVED_363                     = 363,     /*!< reserved                                                            */
   RESERVED_364                     = 364,     /*!< reserved                                                            */
   RESERVED_365                     = 365,     /*!< reserved                                                            */
   RESERVED_366                     = 366,     /*!< reserved                                                            */
   RESERVED_367                     = 367,     /*!< reserved                                                            */
