zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213axx_ca35.h
#define HPDMA2_Channel0                     ((DMA_Channel_TypeDef *) HPDMA2_Channel0_BASE)
#define HPDMA2_Channel1                     ((DMA_Channel_TypeDef *) HPDMA2_Channel1_BASE)
#define HPDMA2_Channel2                     ((DMA_Channel_TypeDef *) HPDMA2_Channel2_BASE)
#define HPDMA2_Channel3                     ((DMA_Channel_TypeDef *) HPDMA2_Channel3_BASE)
#define HPDMA2_Channel4                     ((DMA_Channel_TypeDef *) HPDMA2_Channel4_BASE)
#define HPDMA2_Channel5                     ((DMA_Channel_TypeDef *) HPDMA2_Channel5_BASE)
#define HPDMA2_Channel6                     ((DMA_Channel_TypeDef *) HPDMA2_Channel6_BASE)
#define HPDMA2_Channel7                     ((DMA_Channel_TypeDef *) HPDMA2_Channel7_BASE)
#define HPDMA2_Channel8                     ((DMA_Channel_TypeDef *) HPDMA2_Channel8_BASE)
#define HPDMA2_Channel9                     ((DMA_Channel_TypeDef *) HPDMA2_Channel9_BASE)
#define HPDMA2_Channel10                    ((DMA_Channel_TypeDef *) HPDMA2_Channel10_BASE)
#define HPDMA2_Channel11                    ((DMA_Channel_TypeDef *) HPDMA2_Channel11_BASE)
#define HPDMA2_Channel12                    ((DMA_Channel_TypeDef *) HPDMA2_Channel12_BASE)
#define HPDMA2_Channel13                    ((DMA_Channel_TypeDef *) HPDMA2_Channel13_BASE)
#define HPDMA2_Channel14                    ((DMA_Channel_TypeDef *) HPDMA2_Channel14_BASE)
#define HPDMA2_Channel15                    ((DMA_Channel_TypeDef *) HPDMA2_Channel15_BASE)

#define HPDMA3_Channel0                     ((DMA_Channel_TypeDef *) HPDMA3_Channel0_BASE)
#define HPDMA3_Channel1                     ((DMA_Channel_TypeDef *) HPDMA3_Channel1_BASE)
#define HPDMA3_Channel2                     ((DMA_Channel_TypeDef *) HPDMA3_Channel2_BASE)
#define HPDMA3_Channel3                     ((DMA_Channel_TypeDef *) HPDMA3_Channel3_BASE)
#define HPDMA3_Channel4                     ((DMA_Channel_TypeDef *) HPDMA3_Channel4_BASE)
#define HPDMA3_Channel5                     ((DMA_Channel_TypeDef *) HPDMA3_Channel5_BASE)
#define HPDMA3_Channel6                     ((DMA_Channel_TypeDef *) HPDMA3_Channel6_BASE)
#define HPDMA3_Channel7                     ((DMA_Channel_TypeDef *) HPDMA3_Channel7_BASE)
#define HPDMA3_Channel8                     ((DMA_Channel_TypeDef *) HPDMA3_Channel8_BASE)
#define HPDMA3_Channel9                     ((DMA_Channel_TypeDef *) HPDMA3_Channel9_BASE)
#define HPDMA3_Channel10                    ((DMA_Channel_TypeDef *) HPDMA3_Channel10_BASE)
#define HPDMA3_Channel11                    ((DMA_Channel_TypeDef *) HPDMA3_Channel11_BASE)
#define HPDMA3_Channel12                    ((DMA_Channel_TypeDef *) HPDMA3_Channel12_BASE)
#define HPDMA3_Channel13                    ((DMA_Channel_TypeDef *) HPDMA3_Channel13_BASE)
#define HPDMA3_Channel14                    ((DMA_Channel_TypeDef *) HPDMA3_Channel14_BASE)
#define HPDMA3_Channel15                    ((DMA_Channel_TypeDef *) HPDMA3_Channel15_BASE)

#define HASH2                               ((HASH_TypeDef *) HASH2_BASE)
#define HASH2_DIGEST                        ((HASH_DIGEST_TypeDef *) HASH2_DIGEST_BASE)
#define RNG2                                ((RNG_TypeDef *) RNG2_BASE)
#define RAMCFG_SYSRAM                       ((RAMCFG_TypeDef *) RAMCFG_SYSRAM_BASE)
#define RAMCFG_SRAM1                        ((RAMCFG_TypeDef *) RAMCFG_SRAM1_BASE)
#define RAMCFG_RETRAM                       ((RAMCFG_TypeDef *) RAMCFG_RETRAM_BASE)
#define RAMCFG_BKPSRAM                      ((RAMCFG_TypeDef *) RAMCFG_BKPSRAM_BASE)
#define RISC                                ((RISC_TypeDef *)     RISC_BASE)
#define RIMC                                ((RIMC_TypeDef *)     RIMC_BASE)
#define RIFSC_ID                            ((RIFSC_ID_TypeDef *) RIFSC_ID_BASE)
#define IAC                                 ((IAC_TypeDef *)      IAC_BASE)
#define RISAF1                              ((RISAF_TypeDef *)    RISAF1_BASE)
#define RISAF2                              ((RISAF_TypeDef *)    RISAF2_BASE)
#define RISAF4                              ((RISAF_TypeDef *)    RISAF4_BASE)
#define RISAB1                              ((RISAB_TypeDef *)    RISAB1_BASE)
#define RISAB2                              ((RISAB_TypeDef *)    RISAB2_BASE)
#define RISAB3                              ((RISAB_TypeDef *)    RISAB3_BASE)
#define RISAB5                              ((RISAB_TypeDef *)    RISAB5_BASE)

#define BSEC                                ((BSEC_TypeDef *) BSEC_BASE)
#define IWDG1                               ((IWDG_TypeDef *) IWDG1_BASE)
#define IWDG2                               ((IWDG_TypeDef *) IWDG2_BASE)
#define IWDG3                               ((IWDG_TypeDef *) IWDG3_BASE)
#define IWDG4                               ((IWDG_TypeDef *) IWDG4_BASE)
#define WWDG1                               ((WWDG_TypeDef *) WWDG1_BASE)
#define VREFBUF                             ((VREFBUF_TypeDef *) VREFBUF_BASE)
#define DTS                                 ((DTS_TypeDef *) DTS_BASE)
#define SERC                                ((SERC_TypeDef *) SERC_BASE)
#define HDP                                 ((HDP_TypeDef *) HDP_BASE)

#define RCC                                 ((RCC_TypeDef *) RCC_BASE)
#define PWR                                 ((PWR_TypeDef *) PWR_BASE)
#define EXTI1                               ((EXTI_TypeDef *) EXTI1_BASE)
#define EXTI1_C1                            ((EXTI_Core_TypeDef *) EXTI1_C1_BASE)
#define EXTI1_C2                            ((EXTI_Core_TypeDef *) EXTI1_C2_BASE)
#define SYSCFG                              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define GPIOA                               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD                               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE                               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF                               ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG                               ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH                               ((GPIO_TypeDef *) GPIOH_BASE)
#define GPIOI                               ((GPIO_TypeDef *) GPIOI_BASE)

#define RTC                                 ((RTC_TypeDef *) RTC_BASE)
#define TAMP                                ((TAMP_TypeDef *) TAMP_BASE)
#define LPUART1                             ((USART_TypeDef *) LPUART1_BASE)
#define LPTIM3                              ((LPTIM_TypeDef *) LPTIM3_BASE)
#define LPTIM4                              ((LPTIM_TypeDef *) LPTIM4_BASE)
#define LPTIM5                              ((LPTIM_TypeDef *) LPTIM5_BASE)

#define GPIOZ                               ((GPIO_TypeDef *) GPIOZ_BASE)
#define ADF1                                ((MDF_TypeDef *) ADF1_BASE)
#define ADF1_Filter0                        ((MDF_Filter_TypeDef*) ADF1_Filter0_BASE)
#define EXTI2                               ((EXTI_TypeDef *) EXTI2_BASE)
#define EXTI2_C1                            ((EXTI_Core_TypeDef *) EXTI2_C1_BASE)
#define EXTI2_C2                            ((EXTI_Core_TypeDef *) EXTI2_C2_BASE)
#define EXTI2_C3                            ((EXTI_Core_TypeDef *) EXTI2_C3_BASE)
#define LTDC                                ((LTDC_TypeDef *) LTDC_BASE)
#define LTDC_Layer1                         ((LTDC_Layer_TypeDef *) LTDC_Layer1_BASE)
#define LTDC_Layer2                         ((LTDC_Layer_TypeDef *) LTDC_Layer2_BASE)
#define LTDC_Layer3                         ((LTDC_Layer_TypeDef *) LTDC_Layer3_BASE)
#define DCMIPP                              ((DCMIPP_TypeDef *) DCMIPP_BASE)
#define DDRC                                ((DDRC_TypeDef *) DDRC_BASE)
#define DDRDBG                              ((DDRDBG_TypeDef *) DDRDBG_BASE)
#define DDRPERFM                            ((DDRPERFM_TypeDef *) DDRPERFM_BASE)
#define STGENR                              ((STGENR_TypeDef *) STGENR_BASE)
#define STGENC                              ((STGENC_TypeDef *) STGENC_BASE)

#define FMC_Bank1_R                         ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE)
#define FMC_Bank1E_R                        ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE)
#define FMC_Bank3_R                         ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE)
#define FMC_Common_R                        ((FMC_Common_TypeDef *) FMC_Common_R_BASE)
#define SDMMC1                              ((SDMMC_TypeDef *) SDMMC1_BASE)
#define SDMMC2                              ((SDMMC_TypeDef *) SDMMC2_BASE)
#define SDMMC3                              ((SDMMC_TypeDef *) SDMMC3_BASE)
#define ETH1                                ((ETH_TypeDef *) ETH1_BASE)
#define ETH2                                ((ETH_TypeDef *) ETH2_BASE)
#define CA35SSC                             ((CA35SSC_TypeDef *) CA35SSC_BASE)
#define CA35SYSCFG                          ((CA35SYSCFG_TypeDef *) CA35SYSCFG_BASE)
#define DDRPHYC                             ((DDRPHYC_TypeDef *) DDRPHYC_BASE)
#define USBH_OHCI                           ((USBH_OHCI_TypeDef *) USBH_OHCI_BASE)
#define USBH_EHCI                           ((USBH_EHCI_TypeDef *) USBH_EHCI_BASE)
#define USBDR                               ((USB_OTG_GlobalTypeDef *) USBDR_BASE)

#define DBGMCU                              ((DBGMCU_TypeDef *) DBGMCU_BASE)

