zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213axx_ca35.h
/********************  Bit definition for AHB2LFZ register  *******************/
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP_Pos      (0U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP_Pos)    /*!< 0x00000001 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP_Msk              /*!< HPDMA1 Channel 0 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP_Pos      (1U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP_Pos)    /*!< 0x00000002 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP_Msk              /*!< HPDMA1 Channel 1 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP_Pos      (2U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP_Pos)    /*!< 0x00000004 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP_Msk              /*!< HPDMA1 Channel 2 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP_Pos      (3U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP_Pos)    /*!< 0x00000008 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP_Msk              /*!< HPDMA1 Channel 3 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP_Pos      (4U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP_Pos)    /*!< 0x00000010 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP_Msk              /*!< HPDMA1 Channel 4 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP_Pos      (5U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP_Pos)    /*!< 0x00000020 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP_Msk              /*!< HPDMA1 Channel 5 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP_Pos      (6U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP_Pos)    /*!< 0x00000040 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP_Msk              /*!< HPDMA1 Channel 6 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP_Pos      (7U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP_Pos)    /*!< 0x00000080 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP_Msk              /*!< HPDMA1 Channel 7 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP_Pos      (8U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP_Pos)    /*!< 0x00000100 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP_Msk              /*!< HPDMA1 Channel 8 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP_Pos      (9U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP_Pos)    /*!< 0x00000200 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP_Msk              /*!< HPDMA1 Channel 9 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP_Pos     (10U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP_Pos)   /*!< 0x00000400 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP_Msk             /*!< HPDMA1 Channel 10 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP_Pos     (11U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP_Pos)   /*!< 0x00000800 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP_Msk             /*!< HPDMA1 Channel 11 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP_Pos     (12U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP_Pos)   /*!< 0x00001000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP_Msk             /*!< HPDMA1 Channel 12 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP_Pos     (13U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP_Pos)   /*!< 0x00002000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP_Msk             /*!< HPDMA1 Channel 13 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP_Pos     (14U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP_Pos)   /*!< 0x00004000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP_Msk             /*!< HPDMA1 Channel 14 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP_Pos     (15U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP_Pos)   /*!< 0x00008000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP_Msk             /*!< HPDMA1 Channel 15 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP_Pos      (16U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP_Pos)    /*!< 0x00010000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP_Msk              /*!< HPDMA2 Channel 0 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP_Pos      (17U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP_Pos)    /*!< 0x00020000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP_Msk              /*!< HPDMA2 Channel 1 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP_Pos      (18U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP_Pos)    /*!< 0x00040000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP_Msk              /*!< HPDMA2 Channel 2 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP_Pos      (19U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP_Pos)    /*!< 0x00080000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP_Msk              /*!< HPDMA2 Channel 3 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP_Pos      (20U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP_Pos)    /*!< 0x00100000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP_Msk              /*!< HPDMA2 Channel 4 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP_Pos      (21U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP_Pos)    /*!< 0x00200000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP_Msk              /*!< HPDMA2 Channel 5 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP_Pos      (22U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP_Pos)    /*!< 0x00400000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP_Msk              /*!< HPDMA2 Channel 6 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP_Pos      (23U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP_Pos)    /*!< 0x00800000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP_Msk              /*!< HPDMA2 Channel 7 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP_Pos      (24U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP_Pos)    /*!< 0x01000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP_Msk              /*!< HPDMA2 Channel 8 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP_Pos      (25U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP_Msk      (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP_Pos)    /*!< 0x02000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP          DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP_Msk              /*!< HPDMA2 Channel 9 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP_Pos     (26U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP_Pos)   /*!< 0x04000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP_Msk             /*!< HPDMA2 Channel 10 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP_Pos     (27U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP_Pos)   /*!< 0x08000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP_Msk             /*!< HPDMA2 Channel 11 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP_Pos     (28U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP_Pos)   /*!< 0x10000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP_Msk             /*!< HPDMA2 Channel 12 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP_Pos     (29U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP_Pos)   /*!< 0x20000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP_Msk             /*!< HPDMA2 Channel 13 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP_Pos     (30U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP_Pos)   /*!< 0x40000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP_Msk             /*!< HPDMA2 Channel 14 suspend in debug */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP_Pos     (31U)
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP_Msk     (0x1UL << DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP_Pos)   /*!< 0x80000000 */
#define DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP         DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP_Msk             /*!< HPDMA2 Channel 15 suspend in debug */

/********************  Bit definition for AHB2HFZ register  *******************/
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP_Pos      (0U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP_Pos)    /*!< 0x00000001 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP_Msk              /*!< HPDMA3 Channel 0 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP_Pos      (1U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP_Pos)    /*!< 0x00000002 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP_Msk              /*!< HPDMA3 Channel 1 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP_Pos      (2U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP_Pos)    /*!< 0x00000004 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP_Msk              /*!< HPDMA3 Channel 2 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP_Pos      (3U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP_Pos)    /*!< 0x00000008 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP_Msk              /*!< HPDMA3 Channel 3 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP_Pos      (4U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP_Pos)    /*!< 0x00000010 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP_Msk              /*!< HPDMA3 Channel 4 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP_Pos      (5U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP_Pos)    /*!< 0x00000020 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP_Msk              /*!< HPDMA3 Channel 5 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP_Pos      (6U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP_Pos)    /*!< 0x00000040 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP_Msk              /*!< HPDMA3 Channel 6 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP_Pos      (7U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP_Pos)    /*!< 0x00000080 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP_Msk              /*!< HPDMA3 Channel 7 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP_Pos      (8U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP_Pos)    /*!< 0x00000100 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP_Msk              /*!< HPDMA3 Channel 8 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP_Pos      (9U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP_Msk      (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP_Pos)    /*!< 0x00000200 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP          DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP_Msk              /*!< HPDMA3 Channel 9 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP_Pos     (10U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP_Msk     (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP_Pos)   /*!< 0x00000400 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP         DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP_Msk             /*!< HPDMA3 Channel 10 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP_Pos     (11U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP_Msk     (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP_Pos)   /*!< 0x00000800 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP         DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP_Msk             /*!< HPDMA3 Channel 11 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP_Pos     (12U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP_Msk     (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP_Pos)   /*!< 0x00001000 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP         DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP_Msk             /*!< HPDMA3 Channel 12 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP_Pos     (13U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP_Msk     (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP_Pos)   /*!< 0x00002000 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP         DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP_Msk             /*!< HPDMA3 Channel 13 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP_Pos     (14U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP_Msk     (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP_Pos)   /*!< 0x00004000 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP         DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP_Msk             /*!< HPDMA3 Channel 14 suspend in debug */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP_Pos     (15U)
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP_Msk     (0x1UL << DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP_Pos)   /*!< 0x00008000 */
#define DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP         DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP_Msk             /*!< HPDMA3 Channel 15 suspend in debug */

/********************  Bit definition for AHBSRFZ register  *******************/
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP_Pos       (0U)
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP_Msk       (0x1UL << DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP_Pos)     /*!< 0x00000001 */
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP           DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP_Msk               /*!< LPDMA Channel 0 suspend in debug */
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP_Pos       (1U)
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP_Msk       (0x1UL << DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP_Pos)     /*!< 0x00000002 */
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP           DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP_Msk               /*!< LPDMA Channel 1 suspend in debug */
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP_Pos       (2U)
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP_Msk       (0x1UL << DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP_Pos)     /*!< 0x00000004 */
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP           DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP_Msk               /*!< LPDMA Channel 2 suspend in debug */
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP_Pos       (3U)
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP_Msk       (0x1UL << DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP_Pos)     /*!< 0x00000008 */
#define DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP           DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP_Msk               /*!< LPDMA Channel 3 suspend in debug */

