zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213axx_ca35.h
/******************  Bit definition for ETH_ACMMSG_LOCKCTRLLOW register  *******************/
#define ETH_ACMMSG_LOCKCTRLLOW_Pos          (0U)
#define ETH_ACMMSG_LOCKCTRLLOW_Msk          (0xFFFFFFFFUL << ETHH_ACMMSG_LOCKCTRLLOW_Pos)   /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_LOCKCTRLLOW              ETHH_ACMMSG_LOCKCTRLLOW_Msk                    /*!< Locking control low */
#define ETH_ACMMSG_LOCKCTRLLOW_0            (0x1UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_LOCKCTRLLOW_1            (0x2UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_LOCKCTRLLOW_2            (0x4UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_LOCKCTRLLOW_3            (0x8UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_LOCKCTRLLOW_4            (0x10UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_LOCKCTRLLOW_5            (0x20UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_LOCKCTRLLOW_6            (0x40UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_LOCKCTRLLOW_7            (0x80UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_LOCKCTRLLOW_8            (0x100UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_LOCKCTRLLOW_9            (0x200UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_LOCKCTRLLOW_10           (0x400UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_LOCKCTRLLOW_11           (0x800UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_LOCKCTRLLOW_12           (0x1000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_LOCKCTRLLOW_13           (0x2000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_LOCKCTRLLOW_14           (0x4000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_LOCKCTRLLOW_15           (0x8000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_LOCKCTRLLOW_16           (0x10000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_LOCKCTRLLOW_17           (0x20000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_LOCKCTRLLOW_18           (0x40000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_LOCKCTRLLOW_19           (0x80000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_LOCKCTRLLOW_20           (0x100000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_LOCKCTRLLOW_21           (0x200000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_LOCKCTRLLOW_22           (0x400000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_LOCKCTRLLOW_23           (0x800000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_LOCKCTRLLOW_24           (0x1000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_25           (0x2000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_26           (0x4000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_27           (0x8000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_28           (0x10000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_29           (0x20000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_30           (0x40000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_31           (0x80000000UL << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x80000000 */

/******************  Bit definition for ETH_ACMMSG_LOCKCTRLHIGH register  *******************/
#define ETH_ACMMSG_LOCKCTRLHIGH_Pos         (0U)
#define ETH_ACMMSG_LOCKCTRLHIGH_Msk         (0xFFFFFFFFUL << ETHH_ACMMSG_LOCKCTRLHIGH_Pos)   /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_LOCKCTRLHIGH             ETHH_ACMMSG_LOCKCTRLHIGH_Msk                    /*!< Locking control high */
#define ETH_ACMMSG_LOCKCTRLHIGH_0           (0x1UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_LOCKCTRLHIGH_1           (0x2UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_LOCKCTRLHIGH_2           (0x4UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_LOCKCTRLHIGH_3           (0x8UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_LOCKCTRLHIGH_4           (0x10UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_LOCKCTRLHIGH_5           (0x20UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_LOCKCTRLHIGH_6           (0x40UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_LOCKCTRLHIGH_7           (0x80UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_LOCKCTRLHIGH_8           (0x100UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_LOCKCTRLHIGH_9           (0x200UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_LOCKCTRLHIGH_10          (0x400UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_LOCKCTRLHIGH_11          (0x800UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_LOCKCTRLHIGH_12          (0x1000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_13          (0x2000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_14          (0x4000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_15          (0x8000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_16          (0x10000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_17          (0x20000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_18          (0x40000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_19          (0x80000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_20          (0x100000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_21          (0x200000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_22          (0x400000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_23          (0x800000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_24          (0x1000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_25          (0x2000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_26          (0x4000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_27          (0x8000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_28          (0x10000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_29          (0x20000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_30          (0x40000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_31          (0x80000000UL << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x80000000 */

