zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213axx_ca35.h
/****************  Bit definition for RAMCFG_*_CCSR registers  ****************/
#define RAMCFG_CCSR_CRCCS_Pos               (0U)
#define RAMCFG_CCSR_CRCCS_Msk               (0xFFFFFFFFUL << RAMCFG_CCSR_CRCCS_Pos) /*!< 0xFFFFFFFF */
#define RAMCFG_CCSR_CRCCS                   RAMCFG_CCSR_CRCCS_Msk                   /*!< CRC calculated signature */

/*******************************************************/
/*           Reset and Clock Control (RCC)             */
/* Reference document :                                */
/*     Chapter #20 "Reset and clock control (RCC)"     */
/*     RM0506 - Reference Manual - STM32MP21xx         */
/*     advanced ARM-based 32/64-bit MPUs               */
/*******************************************************/
/* Bit fields for RCC_SECCFGR0 register */
#define RCC_SECCFGR0_SEC_Pos                     (0U)
#define RCC_SECCFGR0_SEC_Msk                     (0xFFFFFFFFUL << RCC_SECCFGR0_SEC_Pos)               /*!< 0xFFFFFFFF */
#define RCC_SECCFGR0_SEC                         RCC_SECCFGR0_SEC_Msk                              /*!< Secure attribute reference for local resource number x (x = 31 to 0) */

/* Bit fields for RCC_SECCFGR1 register */
#define RCC_SECCFGR1_SEC_Pos                     (0U)
#define RCC_SECCFGR1_SEC_Msk                     (0xFFFFFFFFUL << RCC_SECCFGR1_SEC_Pos)               /*!< 0xFFFFFFFF */
#define RCC_SECCFGR1_SEC                         RCC_SECCFGR1_SEC_Msk                              /*!< Secure attribute reference for the local resource number x (x = 63 to 32) */

/* Bit fields for RCC_SECCFGR2 register */
#define RCC_SECCFGR2_SEC_Pos                       (0U)
#define RCC_SECCFGR2_SEC_Msk                       (0xFFFFFFFFUL << RCC_SECCFGR2_SEC_Pos)               /*!< 0xFFFFFFFF */
#define RCC_SECCFGR2_SEC                           RCC_SECCFGR2_SEC_Msk                              /*!< Secure attribute reference for the local resource number x (x = 95 to 64) */

/* Bit fields for RCC_SECCFGR3 register */
#define RCC_SECCFGR3_SEC_Pos                       (0U)
#define RCC_SECCFGR3_SEC_Msk                       (0x3FFFFUL << RCC_SECCFGR3_SEC_Pos)                  /*!< 0x0003FFFF */
#define RCC_SECCFGR3_SEC                           RCC_SECCFGR3_SEC_Msk                              /*!< Secure attribute reference for the local resource number x (x = 113 to 96) */

/* Bit fields for RCC_PRIVCFGR0 register */
#define RCC_PRIVCFGR0_PRIV_Pos                     (0U)
#define RCC_PRIVCFGR0_PRIV_Msk                     (0xFFFFFFFFUL << RCC_PRIVCFGR0_PRIV_Pos)             /*!< 0xFFFFFFFF */
#define RCC_PRIVCFGR0_PRIV                         RCC_PRIVCFGR0_PRIV_Msk                            /*!< Privileged attribute reference for local resource number x (x = 31 to 0) */

/* Bit fields for RCC_PRIVCFGR1 register */
#define RCC_PRIVCFGR1_PRIV_Pos                     (0U)
#define RCC_PRIVCFGR1_PRIV_Msk                     (0xFFFFFFFFUL << RCC_PRIVCFGR1_PRIV_Pos)             /*!< 0xFFFFFFFF */
#define RCC_PRIVCFGR1_PRIV                         RCC_PRIVCFGR1_PRIV_Msk                            /*!< Privileged attribute reference for the local resource number x (x = 63 to 32) */

/* Bit fields for RCC_PRIVCFGR2 register */
#define RCC_PRIVCFGR2_PRIV_Pos                     (0U)
#define RCC_PRIVCFGR2_PRIV_Msk                     (0xFFFFFFFFUL << RCC_PRIVCFGR2_PRIV_Pos)             /*!< 0xFFFFFFFF */
#define RCC_PRIVCFGR2_PRIV                         RCC_PRIVCFGR2_PRIV_Msk                            /*!< Privileged attribute reference for the local resource number x (x = 95 to 64) */

/* Bit fields for RCC_PRIVCFGR3 register */
#define RCC_PRIVCFGR3_PRIV_Pos                     (0U)
#define RCC_PRIVCFGR3_PRIV_Msk                     (0x3FFFFUL << RCC_PRIVCFGR3_PRIV_Pos)                /*!< 0x0003FFFF */
#define RCC_PRIVCFGR3_PRIV                         RCC_PRIVCFGR3_PRIV_Msk                            /*!< Privileged attribute reference for the local resource number x (x = 113 to 96) */

/* Bit fields for RCC_RCFGLOCKR0 register */
#define RCC_RCFGLOCKR0_RLOCK_Pos                   (0U)
#define RCC_RCFGLOCKR0_RLOCK_Msk                   (0xFFFFFFFFUL << RCC_RCFGLOCKR0_RLOCK_Pos)           /*!< 0xFFFFFFFF */
#define RCC_RCFGLOCKR0_RLOCK                       RCC_RCFGLOCKR0_RLOCK_Msk                          /*!< RCC local resource number x lock (x = 31 to 0) */

/* Bit fields for RCC_RCFGLOCKR1 register */
#define RCC_RCFGLOCKR1_RLOCK_Pos                   (0U)
#define RCC_RCFGLOCKR1_RLOCK_Msk                   (0xFFFFFFFFUL << RCC_RCFGLOCKR1_RLOCK_Pos)           /*!< 0xFFFFFFFF */
#define RCC_RCFGLOCKR1_RLOCK                       RCC_RCFGLOCKR1_RLOCK_Msk                          /*!< RCC local resource number x lock (x = 63 to 32) */

/* Bit fields for RCC_RCFGLOCKR2 register */
#define RCC_RCFGLOCKR2_RLOCK_Pos                   (0U)
#define RCC_RCFGLOCKR2_RLOCK_Msk                   (0xFFFFFFFFUL << RCC_RCFGLOCKR2_RLOCK_Pos)           /*!< 0xFFFFFFFF */
#define RCC_RCFGLOCKR2_RLOCK                       RCC_RCFGLOCKR2_RLOCK_Msk                          /*!< RCC local resource number x lock (x = 95 to 64) */

/* Bit fields for RCC_RCFGLOCKR3 register */
#define RCC_RCFGLOCKR3_RLOCK_Pos                   (0U)
#define RCC_RCFGLOCKR3_RLOCK_Msk                   (0x3FFFFUL << RCC_RCFGLOCKR3_RLOCK_Pos)              /*!< 0x0003FFFF */
#define RCC_RCFGLOCKR3_RLOCK                       RCC_RCFGLOCKR3_RLOCK_Msk                          /*!< RCC local resource number x lock (x = 113 to 96) */

/* Bit fields for RCC_RxCIDCFGR registers (x in [0;113] */
#define RCC_RxCIDCFGR_CFEN_Pos                     (0U)
#define RCC_RxCIDCFGR_CFEN_Msk                     (0x1UL << RCC_RxCIDCFGR_CFEN_Pos)                    /*!< 0x00000001 */
#define RCC_RxCIDCFGR_CFEN                         RCC_RxCIDCFGR_CFEN_Msk                            /*!< Static CID filter enable */
#define RCC_RxCIDCFGR_SEM_EN_Pos                   (1U)
#define RCC_RxCIDCFGR_SEM_EN_Msk                   (0x1UL << RCC_RxCIDCFGR_SEM_EN_Pos)                  /*!< 0x00000002 */
#define RCC_RxCIDCFGR_SEM_EN                       RCC_RxCIDCFGR_SEM_EN_Msk                          /*!< Semaphore enable */
#define RCC_RxCIDCFGR_SCID_Pos                     (4U)
#define RCC_RxCIDCFGR_SCID_Msk                     (0x7UL << RCC_RxCIDCFGR_SCID_Pos)                    /*!< 0x00000070 */
#define RCC_RxCIDCFGR_SCID                         RCC_RxCIDCFGR_SCID_Msk                            /*!< Static compartment ID */
#define RCC_RxCIDCFGR_SEMWLC_Pos                   (16U)
#define RCC_RxCIDCFGR_SEMWLC_Msk                   (0xFFUL << RCC_RxCIDCFGR_SEMWLC_Pos)                 /*!< 0x00FF0000 */
#define RCC_RxCIDCFGR_SEMWLC                       RCC_RxCIDCFGR_SEMWLC_Msk                          /*!< Semaphore white-list for compartment y (y = 7 to 0) */

/* Bit fields for RCC_RxSEMCR register  ******************/
#define RCC_RxSEMCR_SEM_MUTEX_Pos                  (0U)
#define RCC_RxSEMCR_SEM_MUTEX_Msk                  (0x1UL << RCC_RxSEMCR_SEM_MUTEX_Pos)                 /*!< 0x00000001 */
#define RCC_RxSEMCR_SEM_MUTEX                      RCC_RxSEMCR_SEM_MUTEX_Msk                         /*!< Semaphore mutex */
#define RCC_RxSEMCR_SEMCID_Pos                     (4U)
#define RCC_RxSEMCR_SEMCID_Msk                     (0x7UL << RCC_RxSEMCR_SEMCID_Pos)                    /*!< 0x00000070 */
#define RCC_RxSEMCR_SEMCID                         RCC_RxSEMCR_SEMCID_Msk                            /*!< Semaphore compartment ID */


